{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-0", 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-0_m", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-0_a", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "_sub", 
      "name": "_minus0", 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-1", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-2", 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-2", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-3", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-4_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-4_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-4", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-4", 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 1], [33, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-4", 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-5_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-5_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-5", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-5", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.3"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attr": {
        "axis": "3", 
        "num_outputs": "32", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[45, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[51, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[55, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[52, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[64, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[70, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[70, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[70, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[74, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[71, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten63", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten62", 
      "inputs": [[41, 1, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[85, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten61", 
      "inputs": [[41, 2, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[87, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten60", 
      "inputs": [[41, 3, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[89, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten59", 
      "inputs": [[41, 4, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[91, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten58", 
      "inputs": [[41, 5, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[93, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten57", 
      "inputs": [[41, 6, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[95, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten56", 
      "inputs": [[41, 7, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[97, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten55", 
      "inputs": [[41, 8, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[99, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten54", 
      "inputs": [[41, 9, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[101, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten53", 
      "inputs": [[41, 10, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[103, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten52", 
      "inputs": [[41, 11, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[105, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten51", 
      "inputs": [[41, 12, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[107, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten50", 
      "inputs": [[41, 13, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[109, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten49", 
      "inputs": [[41, 14, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[111, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten48", 
      "inputs": [[41, 15, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t15_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[113, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten47", 
      "inputs": [[41, 16, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t16_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[115, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten46", 
      "inputs": [[41, 17, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t17_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[117, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten45", 
      "inputs": [[41, 18, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t18_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[119, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten44", 
      "inputs": [[41, 19, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t19_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[121, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten43", 
      "inputs": [[41, 20, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t20_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[123, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten42", 
      "inputs": [[41, 21, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t21_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[125, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten41", 
      "inputs": [[41, 22, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t22_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[127, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten40", 
      "inputs": [[41, 23, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t23_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[129, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten39", 
      "inputs": [[41, 24, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t24_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[131, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten38", 
      "inputs": [[41, 25, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t25_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[133, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten37", 
      "inputs": [[41, 26, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t26_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[135, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten36", 
      "inputs": [[41, 27, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t27_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[137, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten35", 
      "inputs": [[41, 28, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t28_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[139, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten34", 
      "inputs": [[41, 29, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t29_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[141, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten33", 
      "inputs": [[41, 30, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t30_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[143, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten32", 
      "inputs": [[41, 31, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t31_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[145, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t31_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus128", 
      "inputs": [[146, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t31_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation323", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[152, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation322", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[152, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul192", 
      "inputs": [[154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation320", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation321", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[152, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul193", 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus129", 
      "inputs": [[156, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation324", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul194", 
      "inputs": [[153, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t30_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[162, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus132", 
      "inputs": [[144, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t30_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation333", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[165, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation332", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[165, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul198", 
      "inputs": [[167, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation330", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation331", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[165, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul199", 
      "inputs": [[169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus133", 
      "inputs": [[168, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation334", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul200", 
      "inputs": [[166, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t29_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[174, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus136", 
      "inputs": [[142, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t29_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation343", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[177, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation342", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[177, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul204", 
      "inputs": [[179, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation340", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation341", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[177, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul205", 
      "inputs": [[181, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus137", 
      "inputs": [[180, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation344", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul206", 
      "inputs": [[178, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t28_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[186, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus140", 
      "inputs": [[140, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t28_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation353", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[189, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation352", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[189, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul210", 
      "inputs": [[191, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation350", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation351", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[189, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul211", 
      "inputs": [[193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus141", 
      "inputs": [[192, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation354", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul212", 
      "inputs": [[190, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t27_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[198, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus144", 
      "inputs": [[138, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t27_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation363", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[201, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation362", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[201, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul216", 
      "inputs": [[203, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation360", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation361", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[201, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul217", 
      "inputs": [[205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus145", 
      "inputs": [[204, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation364", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul218", 
      "inputs": [[202, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t26_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[210, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus148", 
      "inputs": [[136, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t26_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation373", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[213, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation372", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[213, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul222", 
      "inputs": [[215, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation370", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation371", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[213, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul223", 
      "inputs": [[217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus149", 
      "inputs": [[216, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation374", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul224", 
      "inputs": [[214, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t25_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[222, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus152", 
      "inputs": [[134, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t25_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation383", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[225, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation382", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[225, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul228", 
      "inputs": [[227, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation380", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation381", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[225, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul229", 
      "inputs": [[229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus153", 
      "inputs": [[228, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation384", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul230", 
      "inputs": [[226, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t24_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[234, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus156", 
      "inputs": [[132, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t24_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation393", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[237, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation392", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[237, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul234", 
      "inputs": [[239, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation390", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation391", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[237, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul235", 
      "inputs": [[241, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus157", 
      "inputs": [[240, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation394", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul236", 
      "inputs": [[238, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t23_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[246, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus160", 
      "inputs": [[130, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t23_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation403", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[249, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation402", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[249, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul240", 
      "inputs": [[251, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation400", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation401", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[249, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul241", 
      "inputs": [[253, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus161", 
      "inputs": [[252, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation404", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul242", 
      "inputs": [[250, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t22_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[258, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus164", 
      "inputs": [[128, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t22_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation413", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation412", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul246", 
      "inputs": [[263, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation410", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation411", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[261, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul247", 
      "inputs": [[265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus165", 
      "inputs": [[264, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation414", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul248", 
      "inputs": [[262, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t21_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[270, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus168", 
      "inputs": [[126, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t21_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation423", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[273, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation422", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[273, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul252", 
      "inputs": [[275, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation420", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation421", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[273, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul253", 
      "inputs": [[277, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus169", 
      "inputs": [[276, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation424", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul254", 
      "inputs": [[274, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t20_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[282, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus172", 
      "inputs": [[124, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t20_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation433", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[285, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation432", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[285, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul258", 
      "inputs": [[287, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation430", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation431", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[285, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul259", 
      "inputs": [[289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus173", 
      "inputs": [[288, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation434", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul260", 
      "inputs": [[286, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t19_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[294, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus176", 
      "inputs": [[122, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t19_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation443", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[297, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation442", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[297, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul264", 
      "inputs": [[299, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation440", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation441", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[297, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul265", 
      "inputs": [[301, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus177", 
      "inputs": [[300, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation444", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul266", 
      "inputs": [[298, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t18_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[306, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus180", 
      "inputs": [[120, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t18_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation453", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[309, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation452", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[309, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul270", 
      "inputs": [[311, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation450", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation451", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[309, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul271", 
      "inputs": [[313, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus181", 
      "inputs": [[312, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation454", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul272", 
      "inputs": [[310, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t17_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[318, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus184", 
      "inputs": [[118, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t17_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation463", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[321, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation462", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[321, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul276", 
      "inputs": [[323, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation460", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation461", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[321, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul277", 
      "inputs": [[325, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus185", 
      "inputs": [[324, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation464", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul278", 
      "inputs": [[322, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t16_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[330, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus188", 
      "inputs": [[116, 0, 0], [331, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t16_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[332, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation473", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[333, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation472", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[333, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul282", 
      "inputs": [[335, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation470", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[333, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation471", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[333, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul283", 
      "inputs": [[337, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus189", 
      "inputs": [[336, 0, 0], [339, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation474", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[340, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul284", 
      "inputs": [[334, 0, 0], [341, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t15_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[342, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus192", 
      "inputs": [[114, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t15_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[344, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation483", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[345, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation482", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[345, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul288", 
      "inputs": [[347, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation480", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation481", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[345, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul289", 
      "inputs": [[349, 0, 0], [350, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus193", 
      "inputs": [[348, 0, 0], [351, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation484", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[352, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul290", 
      "inputs": [[346, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[354, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus196", 
      "inputs": [[112, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t14_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[356, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation493", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[357, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation492", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[357, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul294", 
      "inputs": [[359, 0, 0], [352, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation490", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[357, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation491", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[357, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul295", 
      "inputs": [[361, 0, 0], [362, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus197", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation494", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[364, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul296", 
      "inputs": [[358, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[366, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus200", 
      "inputs": [[110, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t13_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation503", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation502", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul300", 
      "inputs": [[371, 0, 0], [364, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation500", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation501", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[369, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul301", 
      "inputs": [[373, 0, 0], [374, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus201", 
      "inputs": [[372, 0, 0], [375, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation504", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[376, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul302", 
      "inputs": [[370, 0, 0], [377, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[378, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus204", 
      "inputs": [[108, 0, 0], [379, 0, 0]]
    }, 
    {
